In [9]:
require(ggplot2)
require(plotly)
salary <- read.csv("C:/Users/Amlan/Documents/Amlan's Website/salary_estimates.csv", header=T)
salary.dt <- read.csv("C:/Users/Amlan/Documents/Amlan's Website/salary_estimates_dt.csv", header=T)
head(salary)
tail(salary.dt)

  State   Year Salary Source Note
1 Alabama 11   49034  ACS
2 Alabama 12   49292  ACS
3 Alabama 13   49643  ACS
4 Alabama 14   49742  ACS
5 Alabama 15   50039  ACS
6 Alabama 16   50456  ACS

    State   Year ACS      NEA      DIFF    Note
301 Wyoming 2011 $56,242  $56,100  $142
302 Wyoming 2012 $57,454  $56,774  $680
303 Wyoming 2013 $58,297  $56,775  $1,522
304 Wyoming 2014 $58,876  $56,583  $2,293
305 Wyoming 2015 $59,390  $57,414  $1,976  est
306 Wyoming 2016 $60,316  $57,761  $2,555  est